import java.util.Arrays;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * Created by Acer552 on 25.07.2016.
 */
public class PasExEmail {
    public static void main(String[] args) {
        /*2) Дан текст: «Достоинствами электронной почты являются: легко воспринимаемые и запоминаемые
        человеком адреса вида имя_пользователя@имя_домена (например, somebody@example.com, cool.mail@habrahabr.ru!); возможность передачи
        как простого текста, так и форматированного, а также произвольных файлов; независимость серверов (в общем случае они
        обращаются друг к другу непосредственно); достаточно высокая надёжность доставки сообщения; простота
        использования человеком и программами. Автор: mymail@g.ua. »
        Используя split создать массив String-ов и после ряда проверок (какие они будут
        решать вам) нужно получить на выходе массив в котором хранятся почтовые адреса.
    */
        String str = "2) Дан текст: «Достоинствами электронной почты являются: легко воспринимаемые и запоминаемые человеком адреса \n" +
                "вида имя_пользователя@имя_домена (например, somebody@example.com, cool.mail@habrahabr.ru!); возможность\n" +
                " передачи как простого текста, так и форматированного, а также произвольных файлов; независимость серверов (в общем случае они обращаются \n" +
                "друг к другу непосредственно); достаточно высокая надёжность доставки сообщения; простота использования человеком и программами. Автор: mymail@g.ua. » \n" +
                "Используя split создать массив String-ов и после ряда проверок (какие они будут решать вам)piasterol@meta.ua нужно получить на выходе массив в котором хранятся почтовые адреса.";
        String[] res = new String[1000];

        for (int i = 0; i < res.length; i++) {
            //  res[i] = "";
            String myPatern = "[a-zA-Z0-9_.-]+@[a-zA-Z0-9_.-]+.[a-z]{2,3}";
            Pattern mySpliter = Pattern.compile(myPatern);//
            Matcher m = mySpliter.matcher(str);
            int count = 0;

            while (m.find()) {
                res[count] = m.group();
                count++;
                if (count>5)break;

            }
        }
        System.out.println(Arrays.toString(res));
    }
}