package HomeWork.date160727;

/**
 * Создайте программу, которая будет генерировать и выводить на экран вещественное псевдослучайное число из промежутка [-3;3).
 */
public class Katya160727Ex4 {
    public static void main(String[] args) {
        System.out.println((int)(Math.random()*6)-3);
    }


}
