package HomeWork.date160727;

/**
 * Created by Игорь on 27.07.2016.
 */
/**
 * Написать метод который будет вычслять и выводить на экран косинусы углов в 60, 45 и 40.
 */
public class Tar160727Ex5 {
    public static void main(String[] args) {
        System.out.println("Косинус кута 60: " +  Math.cos(60*Math.PI/180));
        System.out.println("Косинус кута 45: " +  Math.cos(45*Math.PI/180));
        System.out.println("Косинус кута 40: " +  Math.cos(40*Math.PI/180));
    }
}
