package HomeWork.date160721;

/**
 * Created by Admin on 25.07.2016.
 */
public class HavEx2 {

/*Дан текст: «Достоинствами электронной почты являются: легко воспринимаемые и запоминаемые
человеком адреса вида имя_пользователя@имя_домена (например, somebody@example.com,
cool.mail@habrahabr.ru!); возможность передачи как простого текста, так и форматированного, а также
произвольных файлов; независимость серверов (в общем случае они обращаются друг к другу
непосредственно); достаточно высокая надёжность доставки сообщения; простота использования человеком и
программами. Автор: mymail@g.ua. »
Используя split создать массив String-ов и после ряда проверок (какие они будут решать вам) нужно получить
на выходе массив в котором хранятся почтовые адреса.*/

    public static void main(String[] args) {
        
    }
}
